<html>

<head>
<title>Nero di Seppia - Recensioni</title>
</head>

<body text="#000000" link="#000000" vlink="#000000" alink="#000000" bgcolor="#ffffff">
<font face="Verdana">

<br>
<center>
<img src="..\images\stampa.gif" alt="Recensioni">
</center>
<br>

<hr width="70%">

<br>
<br>

<a name="lista"></a>
<font size="4"><strong>Recensioni</strong></font>
<ul>
   <li><a href="#intervista">Intervista al Gazzettino - 13/01/1999</a></li>
   <li><a href="#recensione">Recensione del Gazzettino - 13/01/1999</a></li>
</ul>

<br>
<br>
<br>
<br>
<br>
<a name="intervista"></a>
<center>
<font size="2"><strong>CROSSOVER.</strong>
Bella prova dei &quot;Nero di Seppia&quot; nel loro album di esordio discografico</font><br>
<font size="6"><strong>RISOTTI & ALTRE RICETTE</strong></font><br>
<font size="2"><em>Dal rock-blues pesante al clima jazz, ecco un suono molto &quot;nero&quot;</em></font>
</center>
<br><br><br>
<font size="2">
Forse perch&eacute; lontani dalle tradizionali &quot;scene&quot; musicali della regione,
i friulani <strong>Nero di Seppia</strong> sono finora passati un p&ograve; inosservati.
Un vero peccato, perch&eacute; il loro album d'esordio dal titolo particolare,
&quot;<a href="dischi.htm#risottiealtrericette">Risotti e altre ricette</a>&quot;,
&egrave; un buon lavoro in direzione di un crossover che fonde ritmo venato di atmosfere
&quot;black&quot; e melodie non banali. Ne parliamo con
<a href="gruppo.htm#pietro">Pietro Tonchia</a> e 
<a href="gruppo.htm#gianfranco">Gianfranco Zuliani</a>,
rispettivamente bassista e chitarrista della band, di cui ripercorrono una breve storia.<br>
<br>
&quot;Il nucleo storico, composto da basso e batteria, &egrave; nato gi&agrave; nell'88, anche
se con denominazioni diverse. Ci siamo chiamati per un certo punto Skylarking, poi X-Up,
cambiando nel contempo anche lo stile: all'inizio siamo nati come il classico gruppo anni '80
che faceva cover di U2 e Litfiba. Questo gruppo, invece, &egrave; nato tre anni fa, con l'innesto
della voce, del sax e della chitarra. Ingressi che sono serviti anche per rivedere e riarrangiare
una parte del nuovo repertorio, con nuove esigenze e nuove sonorit&agrave;&quot;.<br>
<br>
<strong>- Il suono sembra molto vicino a quello che fino a un paio di anni fa era chiamato
&quot;acid jazz&quot;, e in ogni caso &egrave; molto &quot;nero&quot;...</strong><br>
<br>
&quot;Sicuramente &egrave; dovuto al fatto che siamo passati da un chitarrista rock-blues 
abbastanza 'pesante' ad uno molto pi&ugrave; legato al jazz. Per noi &egrave; stato un cambiamento
spontaneo, assolutamente non studiato. Forse per questo c'&egrave; magari anche un p&ograve; di
disomogeneit&agrave; nel tutto, con brani che vanno dal rock duro al quasi swingato, passando per
new-wave e rock progressivo&quot;.<br>
<br>
<strong>- Da cosa nasce l'esigenza di fare un disco, anche se non siete pi&ugrave; dei
&quot;debuttanti&quot;?</strong><br>
<br>
&quot;Il disco nasce come ideale raccolta di tutti i pezzi fatti fino a questo momento: d&agrave;
una certa visione del gruppo che costituisce anche la nostra caratteristica positiva, o negativa
se preferisci. Ognuno, in pratica, sente musica diversa, e quindi nella band porta una parte 
della sua esperienza e del suo background. Questo ci permette di non avere vincoli di alcun
tipo, e di ottenere un suono nato quasi casualmente, con i vari cambi di formazione&quot;.<br>
<br>
<strong>- Da dove viene il titolo &quot;gastronomico&quot; del Cd?</strong><br>
<br>
&quot;Il titolo, come del resto il nostro nome, &egrave; un'idea colta al volo, senza troppe
riflessioni. Per&ograve; collima perfettamente con la fase di produzione, visto che nasce
dall'improvvisazione. E anche la nostra musica parte dall'improvvisazione per poi andare
verso la direzione che ognuno trova pi&ugrave; congeniale. Comunque, visto che per anni 
abbiamo suonato rock-blues, l'anima di questo tipo esce inevitabilmente: di sicuro non &egrave;
una musica fredda o supertecnica&quot;.<br>
<br>
<strong>- Vi sentite pi&ugrave; band da studio o da concerto?</strong><br>
<br>
&quot;In regione abbiamo suonato molto, e abbiamo anche partecipato a diversi concorsi, da
Arezzo Wave a Rock Targato Italia, che ci vedr&agrave; tra i semifinalisti regionali, il 19
a Trieste. Certo, per un gruppo numeroso e rumoroso come noi &egrave; sempre difficile
trovare da suonare in zona, ma siamo sempre pi&ugrave; fortunati di molte band costrette
a rimanere chiuse in cantina. Forse perch&eacute; per noi il primo punto, e il pi&ugrave;
importante, resta sempre il divertimento&quot;.

</font>
<br>
<br>
<br>
<a href="#lista"><font size="2">Recensioni</font></a>


<br>
<br>
<br>
<br>
<br>
<a name="recensione"></a>
<center>
<font size="6"><strong>&quot;Acid&quot; s&igrave;, ma anche &quot;Chili&quot;</strong></font>
</center>
<br><br><br>
<font size="2">
&quot;Piccolo compendio di primi piatti per gente dal palato raffinato&quot; &egrave; il 
sottotitolo scelto dai Nero di Seppia per il loro esordio, l'album autoprodotto inciso
solo in un paio di giorni, quasi un anno fa, e intitolato <strong>&quot;Risotti e altre
ricette&quot;</strong>. Ma non &egrave; solo la gola a essere solleticata, dopo l'ascolto
delle nove tracce dell'album sempre in bilico tra quella miscela di funky, blues e un
pizzico di rock che qualcuno chiama(va) per comodit&agrave; acid jazz. Anche se poi, in
realt&agrave;, gli stessi membri della band giurano di non essere proprio degli appassionati
di questo genere, e di avere influenze e gusti personali anche lontani anni luce dal calore
e dal ritmo pure presenti nell'album.<br>
<br>
<a href="gruppo.htm#gabriella">Gabriella Cainero</a> alla voce,
<a href="gruppo.htm#alberto">Alberto Chiappini</a> alla batteria,
<a href="gruppo.htm#pietro">Pietro Tonchia</a> al basso,
<a href="gruppo.htm#aldo">Aldo Venuti</a> alle tastiere,
<a href="gruppo.htm#giuseppe">Giuseppe Manto</a> al sax e 
<a href="gruppo.htm#gianfranco">Gianfranco Zuliani</a> alla chitarra hanno inciso
(con l'aiuto del secondo sax Piero Purini e della voce rap di Fabrizio Longo) un album 
che solo alla lontana rieccheggia la new-wave, e che pi&ugrave; spesso passa attraverso
quella leggerezza &quot;positiva&quot; costituita da un crossover pi&ugrave; o meno delicato,
in cui una voce &quot;soul&quot; viene affiancata da una ritmica sempre &quot;su di giri&quot;.
Questo accade soprattutto nell'iniziale &quot;Un fatto normale&quot;, nella elaborata e molto
ben riuscita &quot;Echo&quot;, ma anche nella lunga e intensa &quot;Fiore&quot; (che in alcuni punti
non pu&ograve; non ricordare i Red Hot Chili Peppers dei tempi d'oro, anche se in versione
&quot;sognante&quot;), per non dimenticare il fluire &quot;easy&quot; di &quot;Pesce vino e 
zanzare&quot;.
</font>
<br>
<br>
<br>
<a href="#lista"><font size="2">Recensioni</font></a>

<br>
<br>
<br>

<hr width="70%">
<center>
<font size="1">
<a href="..\index.htm">principale</a>
<a href="bio.htm">biografia</a>
<a href="gruppo.htm">componenti</a>
<a href="dischi.htm">produzioni</a>
<font color="#c0c0c0">recensioni</font>
<a href="testi.htm">testi e musica</a>
<a href="curioso.htm">curiosit&agrave;</a>
<a href="info.htm">informazioni</a>
</font>
</center>
<hr width="70%">

<br>
<br>
<font size="1">
<img src="..\images\minilogo.gif" alt="NdS" align="right">
<br>
<br>
<hr align="left" width="75%">
Per commenti o suggerimenti: <a href="mailto:nerodiseppia@hotmail.com">nerodiseppia@hotmail.com</a><br>
</font>

</font>
</body>
</html>
